title: Windows Encoded PowerShell Detection
status: experimental
description: Detects the execution of Base64-encoded PowerShell commands using Sysmon Event ID 1.
author: Prishitha Reddy Lokareddy
date: 2026-07-05

references:
  - https://attack.mitre.org/techniques/T1059/001/

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    EventID: 1
  condition: selection

falsepositives:
  - System administrators running legitimate PowerShell scripts.
  - Automated maintenance or deployment scripts.
  - Software installation or update processes.
  - Security testing performed by administrators.

level: high

tags:
  - attack.execution
  - attack.T1059.001
